class Strings {
  static const String appTitle = 'Neuronio';
  static const String appSiteLink = "https://neuronio.ir";
  static const String bottomNavigationHomeTitle = 'خانه';
  static const String bottomNavigationPanelTitle = 'پنل کاربری';
  static const String bottomNavigationServicesTitle = 'خدمات';
  static const String bottomNavigationProfileTitle = 'پروفایل';

//
  static const String registerHeaderMessage =
      "ثبت نام / ورود در نورونیو به عنوان:";
  static const String registerAsDoctorMessage = "ثبت نام / ورود پزشکان";

  static const String registerAsPatientMessage = "ثبت نام / ورود بیمار";
  static const String signInHeaderMessage = ": ورود در نورونیو به عنوان";
  static const String yourDoctorMessage = "پزشک همراه شما";
  static const String yourPatientMessage = "همگام با بیمار";
  static const String patientRegisterMessage =
      "بعد از ثبت‌نام و ورود، آنلاین پیگیر روند بهبود خود باشید";
  static const String doctorRegisterMessage =
      "بعدز از ثبت‌نام و ورود، وضعیت مراجعین را آنلاین دنبال نمایید";
  static const String verificationCodeMessage =
      "کد ارسال شده به ایمیل یا شماره همراه خود را وارد کنید";
  static const String oneStepToDoctorMessage = "یک قدم تا پزشک فاصله دارید";
  static const String requiredPatientInfoMessage =
      "این اطلاعات به ما کمک می کند تا راحت‌تر خدمات مورد نیاز شما را ارائه دهیم.";
  static const String oneStepToOfficeMessage =
      ".یک قدم تا مطب مجازی خود فاصله دارید";
  static const String patientClinicSuggestionMessage =
      "شما از طریق کدام کلینیک با ما آشنا شدید؟";
  static const String usernameInputHint = "شماره همراه";
  static const String verificationHint = "ورود کد ارسال شده";
  static const String doctorIdInputHint = "شماره نظام پزشکی";
  static const String firstNameInputHint = "نام";
  static const String lastNameInputHint = "نام خانوادگی";
  static const String nationalCodeInputHint = "کدملی";
  static const String expertiseInputHint = "تخصص";

  static const String passInputHint = "رمز عبور";
  static const String verifyAction = "دریافت";
  static const String registerAction = "ثبت نام";
  static const String nextStepAction = "گام بعد";
  static const String welcome = "خوش آمدید";
  static const String requiredPatientInfo = "اطلاعات مورد نیاز";
  static const String continueAction = "ادامه";
  static const String requestAction = "درخواست";
  static const String enterAction = "ورود";
  static const String accountQuestion = "حساب کاربری دارید؟";
  static final String searchBoxHint = 'جست‌و‌جو';
  static final String PatientSearchBoxHint = 'جست‌وجوی متخصص';
  static final String PatientSearchBoxTooltip =
      'برای جست‌و‌جو و اتصال به پزشک، کلیک کنید';
  static final String DoctorSearchBoxHint = 'جست‌و‌جوی بیماران شما';
  static final String docupIntroHomePart1 = 'نورونیو';

//
  static final String docupIntroHomePart2 = 'پل ارتباطی بین پزشک و بیمار';
  static final String medicineReminder = 'یادآوری داروها';
  static final String doctorTrackingLabel = 'مراجعین من';
  static final String patientPanelMenuLabel = 'پنل کاربری';
  static final String doctorPanelMenuLabel = 'مطب مجازی';

//
  static final String panelIDoctorLabel = 'پزشکان من';
  static final String panelIPatientLabel = 'بیماران در حال درمان';
  static final String panelHealthFileLabel = 'پرونده سلامت';
  static final String panelHealthScheduleLabel = 'تقویم سلامت';
  static final String panelIDoctorEmptyLabel =
      'در حال حاضر با پزشکی ارتباط ندارید';
  static final String panelIPatientEmptyLabel =
      'در حال حاضر با بیماری ارتباط ندارید';

//
  static final String doctorPanelRequestsLabel = 'درخواست‌ها';
  static final String doctorPanelHistoryLabel = 'تاریخچه';
  static final String doctorPanelHealthEventsLabel = 'رویدادهای سلامت';

//
  static final String panelDocumentSubLabel = 'مدارک';
  static final String panelResultsSubLabel = 'نتایج آزمایش';
  static final String panelMedicinesSubLabel = 'داروها و نسخه‌ها';
  static final String panelPicturesSubLabel = 'تصاویر عارضه';

//
  static final String panelReminderSubLabel = 'یادآوری داروها';
  static final String panelEventsSubLabel = 'رویدادها';
  static final String panelCalendarSubLabel = 'تقویم';
  static final String panelVisitsSubLabel = 'زمان‌های ویزیت';

//
  static final String illnessInfoPicListLabel = 'تست‌های شناختی';
  static final String illnessInfoPicUploadLabel = 'شروع تست';
  static final String illnessInfoPicShowLabel = 'مشاهده همه';
  static final String illnessInfoLastPicsLabel = 'نتایج تست‌های پیشین';

//
  static final String panelDoctorAdvicePicLabel = 'توصیه‌ها';
  static final String panelDoctorAdvicePicListLabel = 'توصیه های پیشین';
  static final String panelDoctorAdvicePicUploadLabel = 'ارسال توصیه';
  static final String emptyPanelDoctorAdviceFiles =
      'فایل توصیه‌ای موجود نمی باشد.';

  static final String panelPrescriptionsPicLabel = 'نسخه‌ها';
  static final String panelPrescriptionsUploadLabel = 'ارسال نسخه';
  static final String panelPrescriptionsPicListLabel = 'نسخه‌های پیشین';
  static final String emptyPrescriptionFiles = 'فایل نسخه‌ای موجود نمی باشد.';

  static final String panelTestResultsPicLabel = 'آزمایش‌ها';
  static final String panelTestResultsPicUploadLabel = 'ارسال آزمایش';
  static final String panelTestResultsPicListLabel = 'نتایج آزمایش‌های پیشین';
  static final String emptyTestFiles = 'فایل آزمایشی موجود نمی باشد.';
  static final String seeTestResultsUseScreeningPlan =
      "نتیجه ارزیابی شما ثبت شد. ابتدا باید توسط پزشک خود ویزیت شوید تا نتایج ارزیابی شما به صورت دقیق‌تر تحلیل شود.";

  // screening
  static final String noActiveScreeningPlan =
      "شما پلن فعالی را ندارید. سلامتی مغز اصلی ترین رکن بدن هست و باید به آن اهمیت داده شود.";

  static final String neuronioClinicScreeningPlanDescription =
      "خوشحالیم که در مسیر مراقبت از سلامتی  شما همراهتون هستیم." +
          "\n" +
          "همه میدونیم که اگه بخوایم از چیزی مراقبت کنیمُ لازمه اون رو بسنجیم و چه چیزی مهم تر از سلامتی شما! " +
          "\n" +
          "ما اینجا هستیم تا با شما در مسیر سلامتی مغزتون که اصلی ترین رکن بدن هست کمک کنیم." +
          "\n" +
          "اول لازمه تا سلامتی مغز و توانمدی های شناختی شما ارزیابی بشه تا اول از همه به وضعیتش آگاه بشیم و بعد با توجه به سابقه سلامتی شما و شرایط منحصر به فردتون اطلاعات خوبی از سلامت مغز و شناخت  شما بتون داده می شه تا با کمک هم سلامت مغز و شناخت رو ارتقا بدیم و بتونیم به موقع از بیماری های مغز و شناخت مانند آلزایمر پیشگیری کنیم." +
          "\n" +
          "پس به شما میگیم که قراره تو این سفر چه اتفاق هایی بیفته.";

  static final List<String> neuronioClinicScreeningSteps = [
    "  ۱- اول از همه از شما می خواهیم تا تست های خودارزیابی سلامت رو تکمیل کنید و اون ها رو برای ما بفرستین.",
    "  ۲- بعد لازمه تا تست هوشمند سنجش یکپارچه سلامت شناختی رو تکمیل کنید. از اونجا که این تست توسط تبلت از شما گرفته میشه لازمه تا زمان مشترکی رو هماهنگ کنیم. یا شما به محل های تعیین شده تشریف بیارید یا ما تبلت رو درب منزل شما میرسونیم و تست گرفته میشه.",
    "  ۳- بعد از انجام ارزیابی های شناختی نتایج این ارزیابی ها توسط پزشکان متخصص حوزه مغز و شناخت بررسی میشه و شما زمانی رو با پزشک هماهنگ می کنید.",
    "  ۴- شما با پزشک یک ویزیت ۱۵ تا ۳۰  دقیقه ای خواهید داشت. سابقه پزشکی شما بررسی میشه و پزشک نتایج تست های شما که تحلیل و بررسی شدند رو به شما انتقال میده.",
    "  ۵- بر اساس جلسه ای که با پزشک داشتید پروفایلی از سلامت شما بر محور سلامت مغز و شناخت به شما نشون داده میشه.",
    "  ۶- برای حفظ و ارتقای سلامت شما و پیشگیری از بیماری های مغز و شناخت مانند آلزایمر یه سری پیشنهاد مشخص مانند پایش توانمندی های شناختی٬ ویزیت پزشک متخصص در صورت نیاز٬ برنامه بهسازی و توانمندی شناختی شامل بازی های فیزیکی و کاغذی٬ بازی های شناختی بر بستر واقعیت مجازی و . به شما پیشنهاد میشه.",
    "  ۷- از اونجا که مغز سالم در بدن سالمه توی برنامه تون پیشنهادهایی توسط متخصصین برای بهسازی و ارتقای توانمدی های فیزیکی هم داده میشه. که همه این موارد شما رو در ادامه مسیر کمک میکنه.",
    "  ۸- حالا شما از پیشنهادهایی که بتون داده شده اونی رو که به شرایطتون می خوره و براتون مناسبه انتخاب می کنید و بعد ادامه مسیر رو در کنار هم در نورونیو هستیم.",
  ];

  static final String screeningDoctorSelection =
      "اگر دکتری را از قبل می شناسید وارد کنید تا ما ارتباط شما را فراهم کنیم.";
  static final String requestFailed = "درخواست با خطا مواجه شد.";

  /// TODO link should become dynamic
  static final String lifeQuestionerTestLink =
      "https://docs.google.com/forms/d/e/1FAIpQLScCXP2RlG1TYTgeu8gCdOV1Adpaxh1Ae8-7YflIPyTpB6BjJg/viewform";

//
  static final String panelEventPageLabel = 'رویدادها';
  static final String panelReminderPageLabel = 'داروها';

//
  static final String panelIllnessInfoLabel = 'اطلاعات بیماری';
  static final String panelChatLabel = 'چت';
  static final String panelDoctorChatLabel = 'چت با بیمار';
  static final String panelVideoCallLabel = 'تماس';

//
  static final String physicalReservationLabel = 'رزرو ویزیت حضوری';
  static final String virtualReservationLabel = 'رزرو ویزیت مجازی';
  static final String trafficPlanReservationLabel = "خرید پلن متنی";

//
  static final String patientTrackingVisitFaceToFaceLabel = 'ویزیت حضوری';
  static final String patientTrackingVirtualVisitLabel = 'ویزیت مجازی';
  static final String patientTrackingRequestVisitLabel = 'درخواست های ویزیت';

//
  static final String uploadPicTextFieldTitleHint = 'عنوان';
  static final String uploadPicTextFieldDescriptionHint = 'توضیحات';

//
  static final String iDoctorLabel = 'پزشک من';
  static final String iPatientLabel = 'بیمار من';

//
  static final String diseaseImages = "disease_images";
  static final String testResults = "test_results";
  static final String prescriptions = "prescription";
  static final String cognitiveTests = "cognitive_tests";
  static final String doctorAdvice = "documents";

//
  static final String visitRequestLabel = "درخواست ویزیت حضوری";
  static final String virtualVisitRequestLabel = "درخواست ویزیت مجازی";
  static final String inContactLabel = "در حال درمان";
  static final String curedLabel = "درمان شده";

//
  static final String notFoundRequest = 'درخواستی از جانب این بیمار ندارید';
  static final String noAvailableVirtualVisit =
      'ویزیت مجازی در حال حاضر وجود ندارد';
  static final String reserveVirtualVisit = 'رزرو ویزیت';
  static final String reserveVirtualVisitDoctorSide = 'متوجه شدم';
  static final String waitingForApproval = 'در انتظار تایید پزشک';
  static final String waitingForApprovalDoctorSide = 'مشاهده درخواست';
  static final String requestSentLabel = 'درخواست شما ارسال گردید';
  static final String requestSentLabelDoctorSide =
      'درخواست بیمار را قبول یا رد کنید';
  static final String notRequestTime = 'اکنون زمان ویزیت شما نیست';
  static final String notRequestTimeDoctorSide = 'اکنون زمان ویزیت نیست';
  static final String waitLabel = 'منتظر بمانید';

//
  static final String resultSearchLabel = 'نتایج جست‌و‌جو';
  static final String requestsSearchLabel = 'درخواست ها';

//
  static final String emptyDoctorLabel = 'شما به پزشکی متصل نیستید '
      '\n'
      ' لطفا از صفحه جست‌و‌جو متخصصان به پزشک مورد نظر وصل شوید';
  static final String emptyPatientLabel = 'شما به بیماری متصل نیستید '
      '\n'
      ' در قسمت درخواست ها میتوانید به بیماری متصل شوید';

  /// TODO
  static final String learningVideosLink =
      "https://www.aparat.com/Neuronio.Clinic";

//
  static final String emptyWaitDoctorLabel = 'منتظر بمانید';

//  static final String emptyWaitPatientLabel = 'شما به بیماری متصل نیستید '
//      '\n'
//      ' در قسمت درخواست ها میتوانید به بیماری متصل شوید';

  static final String emptyChatPage = 'پیامی تاکنون ارسال نشده است';

//
  static final String emptyDoctorSearch =
      'متاسفانه پزشکی با این نام در نورونیو موجود نمی‌باشد';
  static final String emptyVisitSearch =
      'متاسفانه بیماری با این نام در این بخش موجود نمی‌باشد';
  static final String emptySearchDoctorSide =
      'متاسفانه بیماری با این نام در لیست بیماران شما موجود نمی‌باشد';
  static final String emptyRequestsDoctorSide =
      'درخواستی در حال حاضر موجود نمی‌باشد';

//
  static final String visitRequestedMessage =
      "درخواست رزرو شما با موفقیت ثبت شد در صورت تایید پزشک با مراجعه به پنل کاربری میتوانید ویزیت خود را در زمان مقرر شده انجام بدهید.";
  static final String physicalVisitRequestedMessage =
      "درخواست رزرو شما با موفقیت ثبت شد";
  static final String notEnoughCreditMessage =
      "حساب شما اعتبار کافی ندارد. لطفا حساب تان را شارژ کنید";
  static final String addCreditAction = "افزایش اعتبار";
  static final String understandAction = "متوجه شدم";
  static final String okAction = "باشه";
  static final String deleteAction = "حذف";
  static final String cancelAction = "لغو";
  static final String virtualVisitPrivacyPolicyMessage =
      "من همه قوانین و مقررات رزرو ویزیت مجازی را خوانده و موافقت میکنم";
  static final String physicalVisitPrivacyPolicyMessage =
      "من همه قوانین و مقررات رزرو ویزیت حضوری را خوانده و موافقت میکنم";
  static final String emptyStartVisitTimeMessage =
      "لطفا زمان ویزیت مناسبی را وارد کنید";
  static final String pastStartVisitTimeMessage =
      "شما نمی توانید ساعتی که گذشته است را به عنوان زمان شروع ویزیت انتخاب کنید.";
  static final String invalidDurationPlan_EmptyDurationPlan =
      "پزشک زمانی را برای ویزیت تایید نمی کند.";
  static final List<String> invalidDurationPlan_Plans = [
    "مدت زمان ویزیت انتخاب شده مورد تایید پزشک نیست." +
        "\n" +
        " زمان های مورد تایید، ویزیت های",
    "??",
    "دقیقه ای هستند."
  ];
  static final String enterVisitDateMessage = "لطفا تاریخ ویزیت را وارد کنید";
  static final String offlineDoctorMessage =
      " پزشک آنلاین نیست لطفا زمانی را برای ویزیت مشخص کنید";

  //
  static final String drugNameTextFieldHint = 'نام دارو';
  static final String countTextFieldHint = 'تعداد';
  static final String periodTextFieldHint = 'هر چند ساعت';
  static final String submitDrugLabel = 'ارسال برای بیمار';

  static final String supportWhatsAppLink =
      "whatsapp://send?phone=+989981508215";
  static final String supportTelegramLLink =
      "http://telegram.me/Neuroniosupport";
  static final String supportInstagramLink =
      "http://Instagram.com/neuronio.clinic";

  static final String noVirtualAppointment =
      "هیچ سابقه ای از مشاوره" + "\n" + "مجازی موجود نمی باشد.";

  /// text plan
  static final String buyPlanActionTitle = "خرید";
  static final String noPlanDefinedForDoctorClinic =
      "پلن متنی در کلینیک دکتر مورد نظر تعیین نشده است.";
  static final List<String> sureToBuyTextPlan = [
    "ایا از خرید پلن متنی" + " ",
    "",
    " " + "مطمین هستید؟"
  ];
  static final String planSuccessfullyActivated =
      "پلن متنی با موفقیت خریداری شد.";
  static final String noCreditErrorCode_602 =
      "اعتبار شما برای خرید پلن کافی نمی باشد.";
  static final String oldPlanExistedErrorCode_603 =
      "پلن قبلی شما هنوز تمام نشده است.";
  static final String noRemainedWordForYouPlanInChatRoom =
      "برای چت با پزشک در ساعت های غیر ویزیت، باید پلن متنی تهیه کنید.هنوز پلنی نخریده اید یا پلن قبلی شما تمام شده است.";
  static final String goToTextPlanListPage = "خرید پلن متنی";

  /// Errors
  static final String errorCode_615 = "لطفا عنوان کاربر را درست انتخاب کنید،" +
      "\n" +
      "این کاربر قبلا با عنوان دیگری ثبت نام کرده است.";
  static final String errorCode_616 = "کد فعالسازی را اشتباه وارد کردید";

  static final String visitEventAddedToGoogleCalendar =
      "ویزیت با موفقیت به گوگل کلندر شما اضافه شد.";
  static final String visitEventFailedForGoogleCalendar =
      "اضافه شده ویزیت به گوگل کلندر ناموفق بود!";

  static final String privacyAndPolicy = "قوانین و سیاست ها";
  static final String policyDescription =
      "1- نورونیو به حریم خصوصی کاربران خود احترام می‌گذارد و متعهد است که اطلاعات کاربران خود را محفوظ بدارد." +
          "\n" +
          "2 – شماره تلفن همراه شما، تنها برای ورود به اپلیکیشن نورونیو و کد ملی شما تنها برای تشکیل پرونده سلامتی استفاده می‌شود و در اختیار سایرین قرار نخواهد گرفت." +
          "\n" +
          "3- تمامی اطلاعات و مدارکی که از شما طی مسیر سلامتی خواسته می‌شود، تنها کاربرد پزشکی دارد و هییچگونه استفاده دیگری از آن‌ها نخواهد شد. تمامی این اطلاعات محرمانه نزد نورونیو باقی می‌ماند." +
          "\n" +
          "پرداخت هزینه بسته‌های سنجش سلامتی از طریق استفاده از اعتبار و همچنین پرداخت مستقیم بانکی امکان پذیر است. در صورتیکه مایل به بازگشت وجه باقی‌مانده اعتبار خود هستید، می‌توانید از طریق راه‌های ارتباطی با ما موضوع را مطرح کنید.";
  static final String aboutUsTitle = "درباره ما";
  static final String aboutUsDescription = "اپلیکیشن نورونیو";
  static final String paymentDescriptionTitle = "روش های پرداخت";
  static final String paymentDescriptionPatient =
      "پرداخت هزینه بسته‌های سنجش سلامتی از طریق استفاده از اعتبار و همچنین پرداخت مستقیم بانکی امکان پذیر است. درصورتیکه مایل به افزایش اعتبار خود هستید، مبلغ مورد نظر را وارد نمایید و سپس از طریق درگاه بانکی اعتبار خود را افزایش دهید. همچنین، درصورتیکه بسته سنجش سلامتی خریداری کنید اما اعتبار کافی نداشته باشید، به صورت خودکار به صفحه پرداخت بانکی هدایت خواهید شد. اگر مایل به بازگشت وجه باقی‌مانده اعتبار خود هستید، می‌توانید از طریق راه‌های ارتباطی با ما موضوع را مطرح کنید.";
  static final String paymentDescriptionDoctor =
      "این بخش در آینده تعیین می گردد.";

  static final String doctorBillingDescription =
      "این بخش در آینده تعیین می گردد.";

  static final String patientBillingDescription =
      "درصورتیکه اعتبار خود را افزایش دهید، هزینه بسته‌های سنجش سلامت شناختی می‌تواند از حساب کاربری شما کسر شود. همچنین در صورتیکه مایل به بازگشت وجه باقی‌مانده اعتبار خود هستید، می‌توانید از طریق راه‌های ارتباطی با ما موضوع را مطرح کنید.";

  static final String minimumRequestedCredit =
      "مبلغ درخواست شده کمتر از حد مجاز دو هزار تومان است.";
  static final String videoCallPatientPanelDescription =
      "در صورت تایید پزشک، امکان برقراری ارتباط از طریق تماس تصویری امکان پذیر است";
  static final String videoCallDoctorPanelDescription =
      "با شروع تماس تصویری از سمت بیمار نوتیفیکیشن جهت ملحق شدن برای شما ارسال خواهد شد";
  static final String voiceCallPatientPanelDescription =
      "در صورت تایید پزشک، امکان برقراری ارتباط از طریق تماس صوتی امکان پذیر است";
  static final String voiceCallDoctorPanelDescription =
      "با شروع تماس صوتی از سمت بیمار نوتیفیکیشن جهت ملحق شدن برای شما ارسال خواهد شد";

  static final String noReservedVideoCall =
      "ویزیت تصویری برای اکنون رزرو نشده است.";
  static final String noReservedVoiceCall =
      "ویزیت صوتی برای هم اکنون رزرو نشده است.";

  static final String doctorPlanVisitTimeHelp =
      "جدول زمانی ویزیت ها حدولی است که شما می توانید زمان‌های کاری خود در طول هفته را مشخص کنید تا بیماران بازه‌ای از این زمان را برای ویزیت خود انتخاب کنند." +
          "\n" +
          "در این جدول هر ساعت از شبانه روز به چهار بلاک یا خانه ۱۵ دقیقه ای تقسیم شده است.";

  static final String doctorWarningVisitEnding =
      "پایان زمان ویزیت نزدیک است، ایا مایل به تمدید زمان ویزیت به اندازه دو دقیقه هستید؟\n" +
          "در صورتی که ویزیت را تمدید نکنید تماس به صورت اتوماتیک در پایان زمان ویزین قطع می گردد.";
  static final String endedVisitCallAlertToCloseCall =
      "زمان ویزیت مجازی به پایان رسیده است و امکان برقراری تماس هم اکنون وجود ندارد.";

  /// in-app guid
  static final String navigationBarDescription =
      "در نوار پایین، می‌توانید در بخش‌های خانه، پنل کاربری، خدمات و صفحه پروفایل جابجا شوید." +
          "\n"
              "خانه، جایی است که می‌توانید اعلان‌های جدید و پیام‌های دریافتی خود را مشاهده کنید." +
          "\n" +
          "پنل کاربری، محلی است که می‌توانید پیشرفت برنامه سلامتی خود را ببینید و با پزشک خود ارتباط برقرار کنید." +
          "\n" +
          "در بخش خدمات نیز، تمامی ارزیابی‌ها و انواع خدماتی که به صورت مجازی توسط نورونیو قابل دسترس است نمایش داده می‌شود." +
          "\n" +
          "و نهایتا در صفحه پروفایل، اطلاعات کاربری،  اطلاعات شخصی و پرونده سلامتی شما وجود دارد که می‌توانید آن را ویرایش نمایید.";

  /// occasions
  static final String guidToSiteForMothersDays = "روز مادر مبارک" +
      "\n" +
      "برای استفاده از پکیج ویژه روز مادر و استفاده از تخفیف ۳۰٪ به سایت نورونیو مراجعه کنید و از آنجا کد تخفیف ۳۰٪ را خریداری کنید." +
      "\n" +
      "neuronio.ir";

  static final bankCodes = {
    '207177': 'بانک توسعه صادرات ایران',
    '502229': 'بانک پاسارگاد',
    '502806': 'بانک شهر',
    '502908': 'بانک توسعه تعاون',
    '502910': 'بانک کارآفرین',
    '502938': 'بانک دی',
    '505416': 'بانک گردشگری',
    '505785': 'بانک ایران زمین',
    '505801': 'موسسه مالی و اعتباری کوثر',
    '589210': 'بانک سپه',
    '589463': 'بانک رفاه کارگران',
    '603769': 'بانک صادرات',
    '603770': 'بانک کشاورزی',
    '603799': 'بانک ملی ایران',
    '606373': 'بانک قرض الحسنه مهر ایران',
    '610433': 'بانک ملت',
    '621986': 'بانک سامان',
    '622106': 'بانک پارسیان',
    '627353': 'بانک تجارت',
    '627381': 'بانک انصار',
    '627412': 'بانک اقتصاد نوین',
    '627488': 'بانک کارآفرین',
    '627648': 'بانک توسعه صادرات ایران',
    '627760': 'پست بانک ایران',
    '627884': 'بانک پارسیان',
    '627961': 'بانک صنعت و معدن',
    '628023': 'بانک مسکن',
    '628157': 'موسسه اعتباری توسعه',
    '636214': 'بانک آینده',
    '636795': 'بانک مرکزی جمهوری اسلامی ایران',
    '636949': 'بانک حکمت ایرانیان',
    '639194': 'بانک پارسیان',
    '639217': 'بانک کشاورزی',
    '639346': 'بانک سینا',
    '639347': 'بانک پاسارگاد',
    '639370': 'بانک مهر اقتصاد',
    '639599': 'بانک قوامین',
    '639607': 'بانک سرمایه',
    '991975': 'بانک ملت'
  };
  static final persianDaysSigns = [
    "شنبه",
    "یکشنبه",
    "دوشنبه",
    "سه‌شنبه",
    "‌چهارشنبه",
    "‌پنج‌شنبه",
    "جمعه"
  ];
  static final genders = ["آقا", "خانم"];
  static final Map<String, int> cities = {
    "اوز": 166,
    "آب بر": 1,
    "آب پخش": 2,
    "آباد": 3,
    "آبادان": 4,
    "آباده": 8,
    "آباده طشک": 9,
    "آبدان": 10,
    "آبدانان": 11,
    "آبژدان": 12,
    "آبسرد": 13,
    "آبش احمد": 14,
    "آبعلی": 15,
    "آبگرم": 16,
    "آبی بیگلو": 17,
    "آبیز": 18,
    "آبیک": 19,
    "آجین": 20,
    "آذرشهر": 21,
    "آرادان": 22,
    "آران وبیدگل": 23,
    "آرمرده": 24,
    "آرین شهر": 25,
    "آزادشهر": 26,
    "آزادی": 27,
    "آسارا": 28,
    "آستارا": 29,
    "آستانه": 30,
    "آستانه اشرفیه": 31,
    "آسمان آباد": 32,
    "آشار": 33,
    "آشتیان": 34,
    "آشخانه": 35,
    "آغاجاری": 36,
    "آق قلا": 37,
    "آقکند": 38,
    "آلاشت": 39,
    "آلونی": 40,
    "آمل": 41,
    "آوا": 42,
    "آواجیق": 43,
    "آوج": 44,
    "آوه": 45,
    "آیسک": 46,
    "ابرکوه": 47,
    "ابریشم": 48,
    "ابوحمیظه": 49,
    "ابوزیدآباد": 50,
    "ابوموسی": 51,
    "ابهر": 52,
    "اچاچی": 53,
    "احمد آباد مستوفی": 54,
    "احمدآباد": 55,
    "احمدابادصولت": 56,
    "احمدسرگوراب": 57,
    "اختیارآباد": 58,
    "ادیمی": 59,
    "اراک": 60,
    "اربطان": 66,
    "ارجمند": 67,
    "ارد": 68,
    "ارداق": 69,
    "اردبیل": 70,
    "اردستان": 76,
    "اردکان": 78,
    "اردل": 79,
    "اردیموسی": 80,
    "ارزوییه": 81,
    "ارسک": 82,
    "ارسنجان": 83,
    "ارطه": 84,
    "ارکواز": 85,
    "ارمغانخانه": 86,
    "ارومیه": 87,
    "اروندکنار": 93,
    "ازگله": 94,
    "ازنا": 95,
    "ازندریان": 96,
    "اژیه": 97,
    "اسالم": 98,
    "اسپکه": 99,
    "استهبان": 100,
    "اسدآباد": 101,
    "اسدیه": 102,
    "اسفدن": 103,
    "اسفراین": 104,
    "اسفرورین": 105,
    "اسکو": 106,
    "اسلام آبادغرب": 107,
    "اسلام اباد": 108,
    "اسلام شهر آق گل": 109,
    "اسلامشهر": 113,
    "اسلامیه": 114,
    "اسیر": 115,
    "اشترینان": 116,
    "اشتهارد": 117,
    "اشکذر": 118,
    "اشکنان": 119,
    "اشنویه": 120,
    "اصغرآباد": 121,
    "اصفهان": 122,
    "اصلاندوز": 138,
    "اطاقور": 139,
    "افزر": 140,
    "افوس": 141,
    "اقبالیه": 142,
    "اقلید": 143,
    "الشتر": 144,
    "الوان": 145,
    "الوند": 146,
    "الهایی": 147,
    "الیگودرز": 148,
    "امام حسن": 149,
    "امام شهر": 150,
    "امامزاده عبدالله": 151,
    "املش": 152,
    "امیدیه": 153,
    "امیرکلا": 154,
    "امیریه": 155,
    "امین شهر": 156,
    "انابد": 157,
    "انار": 158,
    "انارستان": 159,
    "انارک": 160,
    "انبارآلوم": 161,
    "اندوهجرد": 162,
    "اندیشه": 163,
    "اندیمشک": 164,
    "اورامان تخت": 165,
    "اهر": 167,
    "اهرم": 168,
    "اهل": 169,
    "اهواز": 170,
    "ایج": 179,
    "ایذه": 180,
    "ایرانشهر": 181,
    "ایزدخواست": 182,
    "ایزدشهر": 183,
    "ایلام": 184,
    "ایلخچی": 185,
    "ایمانشهر": 186,
    "اینچه برون": 187,
    "ایوان": 188,
    "ایوانکی": 189,
    "ایواوغلی": 190,
    "ایور": 191,
    "باب انار": 192,
    "باباحیدر": 193,
    "بابارشانی": 194,
    "بابامنیر": 195,
    "بابکان": 196,
    "بابل": 197,
    "بابلسر": 200,
    "باجگیران": 201,
    "باخرز": 202,
    "بادرود": 203,
    "بادوله": 204,
    "بار": 205,
    "باروق": 206,
    "بازار جمعه": 207,
    "بازرگان": 208,
    "بازفت": 209,
    "باسمنج": 210,
    "باشت": 211,
    "باغ بهادران": 212,
    "باغ ملک": 213,
    "باغستان": 214,
    "باغشاد": 215,
    "باغین": 216,
    "بافت": 217,
    "بافران": 218,
    "بافق": 219,
    "باقرشهر": 220,
    "بالاده": 221,
    "بالاشهر": 222,
    "بانوره": 223,
    "بانه": 224,
    "بایک": 225,
    "باینگان": 226,
    "بجستان": 227,
    "بجنورد": 228,
    "بخشایش": 231,
    "بدره": 232,
    "برازجان": 233,
    "بردخون": 234,
    "بردستان": 235,
    "بردسکن": 236,
    "بردسیر": 237,
    "برده رشه": 238,
    "برزک": 239,
    "برزول": 240,
    "برف انبار": 241,
    "بروات": 242,
    "بروجرد": 243,
    "بروجن": 246,
    "بره سر": 247,
    "بزمان": 248,
    "بزنجان": 249,
    "بستان": 250,
    "بستان آباد": 251,
    "بستک": 252,
    "بسطام": 253,
    "بشرویه": 254,
    "بفروییه": 255,
    "بلاوه": 256,
    "بلبان آباد": 257,
    "بلداجی": 258,
    "بلده": 259,
    "بلورد": 260,
    "بلوک": 261,
    "بم": 262,
    "بمپور": 263,
    "بن": 264,
    "بناب": 265,
    "بناب مرند": 266,
    "بنارویه": 267,
    "بنت": 268,
    "بنجار": 269,
    "بندرامام خمینی": 270,
    "بندرانزلی": 271,
    "بندرترکمن": 274,
    "بندرجاسک": 275,
    "بندردیر": 276,
    "بندردیلم": 277,
    "بندرریگ": 278,
    "بندرعباس": 279,
    "بندرکنگان": 283,
    "بندرگز": 284,
    "بندرگناوه": 285,
    "بندرلنگه": 286,
    "بندرماهشهر": 287,
    "بندزرک": 288,
    "بنک": 289,
    "بوانات": 290,
    "بویین زهرا": 291,
    "بویین سفلی": 292,
    "بوستان": 293,
    "بوشکان": 294,
    "بوشهر": 295,
    "بوکان": 298,
    "بومهن": 299,
    "بویین ومیاندشت": 300,
    "بهاباد": 301,
    "بهار": 302,
    "بهاران شهر": 303,
    "بهارستان": 305,
    "بهبهان": 306,
    "بهرمان": 307,
    "بهشهر": 308,
    "بهمن": 309,
    "بهنمیر": 310,
    "بیارجمند": 311,
    "بیجار": 312,
    "بیدخت": 313,
    "بیدخون": 314,
    "بیدروبه": 315,
    "بیدستان": 316,
    "بیده": 317,
    "بیران شهر": 318,
    "بیرجند": 319,
    "بیرم": 322,
    "بیستون": 323,
    "بیضا": 324,
    "بیکاء": 325,
    "بیله سوار": 326,
    "پاتاوه": 327,
    "پارس آباد": 328,
    "پارسیان": 329,
    "پارود": 330,
    "پاریز": 331,
    "پاکدشت": 332,
    "پاوه": 333,
    "پایین هولار": 334,
    "پردنجان": 335,
    "پردیس": 336,
    "پرند": 337,
    "پرندک": 338,
    "پره سر": 339,
    "پل": 340,
    "پل سفید": 341,
    "پلان": 342,
    "پلدختر": 343,
    "پلدشت": 344,
    "پول": 345,
    "پهله": 346,
    "پیرانشهر": 347,
    "پیربکران": 348,
    "پیرتاج": 349,
    "پیش قلعه": 350,
    "پیشوا": 351,
    "پیشین": 352,
    "تاتارعلیا": 353,
    "تازه آباد": 354,
    "تازه شهر": 355,
    "تازه کندانگوت": 356,
    "تازه کندنصرت آباد": 357,
    "تازیان پایین": 358,
    "تاکستان": 359,
    "تایباد": 360,
    "تبریز": 361,
    "تجریش": 372,
    "تخت": 373,
    "تربت جام": 374,
    "تربت حیدریه": 375,
    "ترک": 376,
    "ترکالکی": 377,
    "ترکمانچای": 378,
    "تسوج": 379,
    "تشان": 380,
    "تفت": 381,
    "تفرش": 382,
    "تکاب": 383,
    "تلخاب": 384,
    "تنکابن": 385,
    "تنکمان": 386,
    "تنگ ارم": 387,
    "توپ آغاج": 388,
    "توتکابن": 389,
    "توحید": 390,
    "تودشک": 391,
    "توره": 392,
    "تویسرکان": 393,
    "تهران": 394,
    "تیتکانلو": 417,
    "تیران": 418,
    "تیرور": 419,
    "تیکمه داش": 420,
    "تیمورلو": 421,
    "ثمرین": 422,
    "جاجرم": 423,
    "جالق": 424,
    "جاورسیان": 425,
    "جایزان": 426,
    "جبالبارز": 427,
    "جعفرآباد": 428,
    "جعفریه": 429,
    "جغتای": 430,
    "جلفا": 431,
    "جلین": 432,
    "جم": 433,
    "جناح": 434,
    "جنت شهر": 435,
    "جنت مکان": 436,
    "جندق": 437,
    "جنگل": 438,
    "جوادآباد": 439,
    "جوان قلعه": 440,
    "جوانرود": 441,
    "جوپار": 442,
    "جورقان": 443,
    "جوزدان": 444,
    "جوزم": 445,
    "جوشقان قالی": 446,
    "جوکار": 447,
    "جولکی": 448,
    "جونقان": 449,
    "جویبار": 450,
    "جویم": 451,
    "جهرم": 452,
    "جیرفت": 453,
    "جیرنده": 454,
    "چابکسر": 455,
    "چابهار": 456,
    "چاپشلو": 457,
    "چادگان": 458,
    "چارک": 459,
    "چاف و چمخاله": 460,
    "چالانچولان": 461,
    "چالوس": 462,
    "چاه دادخدا": 463,
    "چاه مبارک": 464,
    "چاه ورز": 465,
    "چترود": 466,
    "چرام": 467,
    "چرمهین": 468,
    "چشمه شیرین": 469,
    "چغادک": 470,
    "چغامیش": 471,
    "چقابل": 472,
    "چکنه": 473,
    "چگرد": 474,
    "چلگرد": 475,
    "چلیچه": 476,
    "چم گلک": 477,
    "چمران": 478,
    "چمستان": 479,
    "چمگردان": 480,
    "چمن سلطان": 481,
    "چناران": 482,
    "چناران شهر": 483,
    "چناره": 484,
    "چوار": 485,
    "چوبر": 486,
    "چورزق": 487,
    "چویبده": 488,
    "چهارباغ": 489,
    "چهاربرج": 490,
    "چهاردانگه": 491,
    "چیتاب": 492,
    "حاجی آباد": 494,
    "حاجی اباد": 495,
    "حاجیلار": 496,
    "حبیب آباد": 497,
    "حر": 498,
    "حسامی": 499,
    "حسن آباد": 500,
    "حسن اباد": 502,
    "حسین آباد": 503,
    "حسینیه": 504,
    "حصارگرمخان": 505,
    "حکم اباد": 506,
    "حلب": 507,
    "حمزه": 508,
    "حمیدیا": 509,
    "حمیدیه": 510,
    "حمیل": 511,
    "حنا": 512,
    "حویق": 513,
    "خاتون اباد": 514,
    "خارک": 515,
    "خاروانا": 516,
    "خاش": 517,
    "خاکعلی": 518,
    "خالدآباد": 519,
    "خامنه": 520,
    "خان ببین": 521,
    "خانوک": 522,
    "خانه زنیان": 523,
    "خانیمن": 524,
    "خاوران": 525,
    "خداجو(خراجو)": 526,
    "خرامه": 527,
    "خرم آباد": 529,
    "خرمدره": 533,
    "خرمدشت": 534,
    "خرمشهر": 535,
    "خرو": 536,
    "خسروشاه": 537,
    "خشت": 538,
    "خشکبیجار": 539,
    "خشکرود": 540,
    "خضرآباد": 541,
    "خضری دشت بیاض": 542,
    "خلخال": 543,
    "خلیفان": 544,
    "خلیل آباد": 545,
    "خلیل شهر": 546,
    "خمارلو": 547,
    "خمام": 548,
    "خمیر": 549,
    "خمین": 550,
    "خمینی شهر": 551,
    "خنافره": 552,
    "خنج": 553,
    "خنجین": 554,
    "خنداب": 555,
    "خواجو شهر": 556,
    "خواجه": 557,
    "خواف": 558,
    "خوانسار": 559,
    "خوی": 560,
    "خور": 562,
    "خورزوق": 563,
    "خورسند": 564,
    "خورموج": 565,
    "خوزی": 566,
    "خوسف": 567,
    "خوش رودپی": 568,
    "خوشه مهر": 569,
    "خومه زار": 570,
    "دابودشت": 571,
    "داراب": 572,
    "داران": 573,
    "دارخوین": 574,
    "داریان": 575,
    "دالکی": 576,
    "دامغان": 577,
    "دامنه": 578,
    "دانسفهان": 579,
    "داودآباد": 580,
    "داورزن": 581,
    "دبیران": 582,
    "درب بهشت": 583,
    "درب گنبد": 584,
    "درجزین": 585,
    "درچه": 586,
    "درح": 587,
    "درق": 588,
    "درگز": 589,
    "درگهان": 590,
    "درود": 591,
    "دره شهر": 592,
    "دزج": 593,
    "دزفول": 594,
    "دژکرد": 598,
    "دستجرد": 599,
    "دستگرد": 600,
    "دستنا": 601,
    "دشتک": 602,
    "دشتکار": 603,
    "دشتی": 604,
    "دلبران": 605,
    "دلگشا": 606,
    "دلند": 607,
    "دلوار": 608,
    "دلیجان": 609,
    "دماوند": 610,
    "دمق": 611,
    "دندی": 612,
    "دوبرجی": 613,
    "دوراهک": 614,
    "دورود": 615,
    "دوزدوزان": 616,
    "دوزه": 617,
    "دوزین": 618,
    "دوساری": 619,
    "دوست محمد": 620,
    "دوگنبدان": 621,
    "دولت آباد": 623,
    "ده رییس": 624,
    "ده سرخ": 625,
    "دهاقان": 626,
    "دهبارز": 627,
    "دهج": 628,
    "دهدز": 629,
    "دهدشت": 630,
    "دهرم": 631,
    "دهق": 632,
    "دهگلان": 633,
    "دهلران": 634,
    "دیباج": 635,
    "دیزج دیز": 636,
    "دیزیچه": 637,
    "دیشموک": 638,
    "دیلمان": 639,
    "دیواندره": 640,
    "دیهوک": 641,
    "رابر": 642,
    "راز": 643,
    "رازقان": 644,
    "رازمیان": 645,
    "راسک": 646,
    "رامجرد": 647,
    "رامسر": 648,
    "رامشیر": 649,
    "رامهرمز": 650,
    "رامیان": 651,
    "رانکوه": 652,
    "راور": 653,
    "راین": 654,
    "ری": 655,
    "رباط": 656,
    "رباط سنگ": 657,
    "رباطکریم": 658,
    "ربط": 659,
    "رحیم آباد": 660,
    "رزن": 661,
    "رزوه": 662,
    "رستاق": 663,
    "رستم آباد": 664,
    "رستمکلا": 665,
    "رشت": 666,
    "رشتخوار": 672,
    "رضوانشهر": 674,
    "رضویه": 675,
    "رضی": 676,
    "رفسنجان": 677,
    "رفیع": 678,
    "روانسر": 679,
    "رود زرد ماشین": 680,
    "روداب": 681,
    "رودبار": 683,
    "رودبنه": 684,
    "رودسر": 685,
    "رودهن": 686,
    "رودیان": 687,
    "رونیز": 688,
    "رویان": 689,
    "رویدر": 690,
    "ریجاب": 691,
    "ریحان": 692,
    "ریز": 693,
    "ریگ ملک": 694,
    "رینه": 695,
    "ریواده": 696,
    "ریوش": 697,
    "زابل": 698,
    "زارچ": 699,
    "زازران": 700,
    "زاغه": 701,
    "زاووت": 702,
    "زاویه": 703,
    "زاهدان": 704,
    "زاهدشهر": 710,
    "زاینده رود": 711,
    "زرآباد": 713,
    "زرقان": 714,
    "زرگرمحله": 715,
    "زرند": 716,
    "زرنق": 717,
    "زرنه": 718,
    "زرین آباد": 719,
    "زرین رود": 720,
    "زرین شهر": 721,
    "زرینه": 722,
    "زنجان": 723,
    "زنگنه": 727,
    "زنگی آباد": 728,
    "زنوز": 729,
    "زواره": 730,
    "زهان": 731,
    "زهرا": 732,
    "زهره": 733,
    "زهک": 734,
    "زهکلوت": 735,
    "زیار": 736,
    "زیارت": 737,
    "زیارتعلی": 738,
    "زیباشهر": 739,
    "زیدآباد": 740,
    "زیرآب": 741,
    "ساری": 742,
    "ساربوک": 743,
    "ساروق": 744,
    "سالند": 748,
    "سامان": 749,
    "سامن": 750,
    "ساوه": 751,
    "سبزوار": 754,
    "سپیددشت": 757,
    "سجاس": 758,
    "سجزی": 759,
    "سده": 760,
    "سده لنجان": 761,
    "سراب": 762,
    "سراب باغ": 763,
    "سراب دوره": 764,
    "سرابله": 765,
    "سراوان": 766,
    "سرایان": 767,
    "سرباز": 768,
    "سربیشه": 769,
    "سرپل ذهاب": 770,
    "سرخرود": 771,
    "سرخس": 772,
    "سرخنکلاته": 773,
    "سرخون": 774,
    "سرخه": 775,
    "سرداران": 776,
    "سردرود": 777,
    "سردشت": 781,
    "سرعین": 782,
    "سرفاریاب": 783,
    "سرکان": 784,
    "سرگز": 785,
    "سرمست": 786,
    "سرو": 787,
    "سروآباد": 788,
    "سروستان": 789,
    "سریش آباد": 790,
    "سطر": 791,
    "سعادت شهر": 792,
    "سعد آباد": 793,
    "سفیددشت": 794,
    "سفیدسنگ": 795,
    "سفیدشهر": 796,
    "سقز": 797,
    "سگزآباد": 798,
    "سلامی": 799,
    "سلطان آباد": 801,
    "سلطان شهر": 802,
    "سلطانیه": 803,
    "سلفچگان": 804,
    "سلماس": 805,
    "سلمان شهر": 806,
    "سماله": 807,
    "سمنان": 808,
    "سمیرم": 809,
    "سمیع آباد": 810,
    "سنته": 811,
    "سنخواست": 812,
    "سندرک": 813,
    "سنقر": 814,
    "سنگان": 815,
    "سنگدوین": 816,
    "سنگر": 817,
    "سنندج": 818,
    "سودجان": 822,
    "سوران": 823,
    "سورشجان": 824,
    "سورک": 825,
    "سورمق": 826,
    "سوزا": 827,
    "سوسنگرد": 828,
    "سوق": 829,
    "سومار": 830,
    "سه قلعه": 831,
    "سهرورد": 832,
    "سهند": 833,
    "سی سخت": 834,
    "سیاه منصور": 835,
    "سیاهکل": 836,
    "سیدان": 837,
    "سیراف": 838,
    "سیرجان": 839,
    "سیردان": 842,
    "سیرکان": 843,
    "سیریک": 844,
    "سیس": 845,
    "سیلوانه": 846,
    "سیمین شهر": 847,
    "سیمینه": 848,
    "سین": 849,
    "سیه چشمه": 850,
    "سیه رود": 851,
    "شاپورآباد": 852,
    "شادگان": 853,
    "شادمهر": 854,
    "شازند": 855,
    "شال": 856,
    "شاندیز": 857,
    "شاوور": 858,
    "شاهپوراباد": 859,
    "شاهدشهر": 860,
    "شاهدیه": 861,
    "شاهرود": 862,
    "شاهو": 863,
    "شاهین دژ": 864,
    "شاهین شهر": 865,
    "شباب": 866,
    "شبانکاره": 867,
    "شبستر": 868,
    "شرافت": 869,
    "شربیان": 870,
    "شرفخانه": 871,
    "شروینه": 872,
    "شریف آباد": 873,
    "شریفیه": 874,
    "ششتمد": 875,
    "ششده": 876,
    "شفت": 877,
    "شلمان": 878,
    "شلمزار": 879,
    "شمس آباد": 880,
    "شمشک": 881,
    "شنبه": 882,
    "شندآباد": 883,
    "شوسف": 884,
    "شوش": 885,
    "شوشتر": 886,
    "شوط": 887,
    "شوقان": 888,
    "شول آباد": 889,
    "شویشه": 890,
    "شهباز": 891,
    "شهداد": 892,
    "شهر امام": 893,
    "شهراباد": 894,
    "شهربابک": 895,
    "شهرپیر": 896,
    "شهرجدیدهشتگرد": 897,
    "شهرزو": 898,
    "شهرصدرا": 899,
    "شهرضا": 900,
    "شهرک سرجنگل": 901,
    "شهرک علی اکبر": 902,
    "شهرکرد": 903,
    "شهریار": 904,
    "شهمیرزاد": 908,
    "شهیون": 909,
    "شیبان": 910,
    "شیراز": 911,
    "شیرگاه": 922,
    "شیروان": 923,
    "شیرود": 924,
    "شیرین سو": 925,
    "صاحب": 926,
    "صادق اباد": 927,
    "صالح آباد": 930,
    "صالح شهر": 931,
    "صالحیه": 932,
    "صایین قلعه": 933,
    "صباشهر": 934,
    "صحنه": 935,
    "صغاد": 936,
    "صفاییه": 937,
    "صفادشت": 938,
    "صفاشهر": 939,
    "صفی آباد": 941,
    "صمصامی": 942,
    "صوفیان": 943,
    "صومعه سرا": 944,
    "صیدون": 945,
    "ضیاآباد": 946,
    "طاقانک": 947,
    "طالخونچه": 948,
    "طالقان": 949,
    "طبس": 950,
    "طبس مسینا": 951,
    "طبقده": 952,
    "طرق رود": 953,
    "طرقبه": 954,
    "طسوج": 955,
    "عالی شهر": 956,
    "عباس اباد": 957,
    "عجب شیر": 958,
    "عسگران": 959,
    "عسلویه": 960,
    "عشق آباد": 962,
    "عقدا": 963,
    "علامرودشت": 964,
    "علویجه": 965,
    "علی اباد": 966,
    "عماد شهر": 967,
    "عنبر": 968,
    "عنبرآباد": 969,
    "عنبران": 970,
    "غرق آباد": 971,
    "غلامان": 972,
    "فارسان": 973,
    "فارغان": 974,
    "فاروج": 975,
    "فاریاب": 976,
    "فاضل آباد": 977,
    "فامنین": 978,
    "فتح آباد": 979,
    "فتح المبین": 980,
    "فخراباد": 981,
    "فدامی": 982,
    "فرادبنه": 983,
    "فراشبند": 984,
    "فراغی": 985,
    "فرح آباد": 986,
    "فرخ شهر": 987,
    "فرخی": 988,
    "فردوس": 989,
    "فردوسیه": 990,
    "فردیس": 991,
    "فرسفج": 992,
    "فرمهین": 993,
    "فرون اباد": 994,
    "فرهادگرد": 995,
    "فریدونشهر": 996,
    "فریدونکنار": 997,
    "فریم": 998,
    "فریمان": 999,
    "فسا": 1000,
    "فشم": 1001,
    "فلاورجان": 1002,
    "فنوج": 1003,
    "فولادشهر": 1004,
    "فومن": 1005,
    "فهرج": 1006,
    "فیرورق": 1007,
    "فیروزآباد": 1009,
    "فیروزان": 1010,
    "فیروزکوه": 1011,
    "فیروزه": 1012,
    "فیض آباد": 1013,
    "فیل اباد": 1014,
    "فین": 1015,
    "قایم شهر": 1016,
    "قاین": 1017,
    "قادراباد": 1018,
    "قاسم آباد": 1019,
    "قاضی": 1020,
    "قایمیه": 1021,
    "قدس": 1022,
    "قدمگاه": 1023,
    "قرچک": 1024,
    "قرق": 1025,
    "قرقری": 1026,
    "قروه": 1027,
    "قروه درجزین": 1028,
    "قره آغاج": 1029,
    "قره بلاغ": 1030,
    "قره ضیاءالدین": 1031,
    "قزوین": 1032,
    "قشم": 1037,
    "قصابه": 1038,
    "قصرشیرین": 1039,
    "قصرقند": 1040,
    "قطب آباد": 1041,
    "قطرویه": 1042,
    "قطور": 1043,
    "قلعه": 1044,
    "قلعه تل": 1045,
    "قلعه خواجه": 1046,
    "قلعه رییسی": 1047,
    "قلعه قاضی": 1048,
    "قلعه گنج": 1049,
    "قلعه نو": 1050,
    "قلندرآباد": 1051,
    "قم": 1052,
    "قمصر": 1061,
    "قنوات": 1062,
    "قوچان": 1063,
    "قورچی باشی": 1064,
    "قوشچی": 1065,
    "قوشخانه": 1066,
    "قهاوند": 1067,
    "قهجاورستان": 1068,
    "قهدریجان": 1069,
    "قهستان": 1070,
    "قیام دشت": 1071,
    "قیدار": 1072,
    "قیر": 1073,
    "کاج": 1074,
    "کاخک": 1075,
    "کارچان": 1076,
    "کارزین (فتح آباد)": 1077,
    "کاریز": 1078,
    "کازرون": 1079,
    "کاشان": 1080,
    "کاشمر": 1081,
    "کاظم آباد": 1082,
    "کاکی": 1083,
    "کامفیروز": 1084,
    "کامو و چوگان": 1085,
    "کامیاران": 1086,
    "کانی دینار": 1087,
    "کانی سور": 1088,
    "کبودرآهنگ": 1089,
    "کتالم وسادات شهر": 1090,
    "کتیج": 1091,
    "کجور": 1092,
    "کدکن": 1093,
    "کرج": 1094,
    "کردکوی": 1106,
    "کرسف": 1107,
    "کرفس": 1108,
    "کرکوند": 1109,
    "کرمان": 1110,
    "کرمانشاه": 1115,
    "کرند": 1124,
    "کره ای": 1125,
    "کشاورز": 1126,
    "کشکسرای": 1127,
    "کشکوییه": 1128,
    "کلات": 1129,
    "کلاته": 1130,
    "کلاته خیج": 1131,
    "کلاچای": 1132,
    "کلارآباد": 1133,
    "کلاردشت": 1134,
    "کلاله": 1135,
    "کلمه": 1136,
    "کلوانق": 1137,
    "کلور": 1138,
    "کلیبر": 1139,
    "کلیشادوسودرجان": 1140,
    "کمال شهر": 1141,
    "کمشچه": 1142,
    "کمه": 1143,
    "کمیجان": 1144,
    "کنارتخته": 1145,
    "کنارک": 1146,
    "کندر": 1147,
    "کنگ": 1148,
    "کنگاور": 1149,
    "کوار": 1150,
    "کوپن": 1151,
    "کوت سیدنعیم": 1152,
    "کوت عبداله": 1153,
    "کوچصفهان": 1154,
    "کوراییم": 1155,
    "کوزران": 1156,
    "کوزه کنان": 1157,
    "کوشک": 1158,
    "کوشکنار": 1159,
    "کومله": 1160,
    "کوهبنان": 1161,
    "کوهپایه": 1162,
    "کوهدشت": 1163,
    "کوهسار": 1164,
    "کوهستک": 1165,
    "کوهنانی": 1166,
    "کوهنجان": 1167,
    "کوهی خیل": 1168,
    "کوهین": 1169,
    "کهریزسنگ": 1170,
    "کهریزک": 1171,
    "کهک": 1172,
    "کهن آباد": 1173,
    "کهنوج": 1174,
    "کیاسر": 1175,
    "کیاشهر": 1176,
    "کیاکلا": 1177,
    "کیان": 1178,
    "کیانشهر": 1179,
    "کیش": 1180,
    "کیلان": 1181,
    "گالیکش": 1182,
    "گتاب": 1183,
    "گتوند": 1184,
    "گراب": 1185,
    "گراب سفلی": 1186,
    "گراش": 1187,
    "گرگاب": 1188,
    "گرگان": 1189,
    "گرماب": 1193,
    "گرمدره": 1194,
    "گرمسار": 1195,
    "گرمه": 1196,
    "گرمی": 1197,
    "گروک": 1198,
    "گزبرخوار": 1199,
    "گزنک": 1200,
    "گزیک": 1201,
    "گشت": 1202,
    "گل تپه": 1203,
    "گلباف": 1204,
    "گلبهار": 1205,
    "گلپایگان": 1206,
    "گلدشت": 1207,
    "گلزار": 1208,
    "گلسار": 1209,
    "گلستان": 1210,
    "گلشن": 1211,
    "گلشهر": 1212,
    "گلگیر": 1213,
    "گلمکان": 1214,
    "گلمورتی": 1215,
    "گلوگاه": 1217,
    "گله دار": 1218,
    "گلیداغ": 1219,
    "گمیش تپه": 1220,
    "گناباد": 1221,
    "گنبدکاووس": 1222,
    "گنبکی": 1223,
    "گندمان": 1224,
    "گوجان": 1225,
    "گودین": 1226,
    "گوراب زرمیخ": 1227,
    "گوریه": 1228,
    "گوگ تپه": 1229,
    "گوگان": 1230,
    "گوگد": 1231,
    "گوهران": 1232,
    "گهرو": 1233,
    "گهواره": 1234,
    "گیان": 1235,
    "گیلانغرب": 1236,
    "گیوی": 1237,
    "لاجان": 1238,
    "لار": 1239,
    "لالجین": 1240,
    "لاله زار": 1241,
    "لالی": 1242,
    "لامرد": 1243,
    "لاهرود": 1244,
    "لاهیجان": 1245,
    "لای بید": 1246,
    "لپویی": 1247,
    "لردگان": 1248,
    "لشت نشاء": 1249,
    "لطف آباد": 1250,
    "لطیفی": 1251,
    "لمزان": 1252,
    "لنده": 1253,
    "لنگرود": 1254,
    "لواسان": 1255,
    "لوجلی": 1256,
    "لوشان": 1257,
    "لولمان": 1258,
    "لومار": 1259,
    "لوندویل": 1260,
    "لیردف": 1261,
    "لیسار": 1262,
    "لیکک": 1263,
    "لیلان": 1264,
    "مادرسلیمان": 1265,
    "مادوان": 1266,
    "مارگون": 1267,
    "ماژین": 1268,
    "ماسال": 1269,
    "ماسوله": 1270,
    "ماکلوان": 1271,
    "ماکو": 1272,
    "مال خلیفه": 1273,
    "مامونیه": 1274,
    "ماه نشان": 1275,
    "ماهان": 1276,
    "ماهدشت": 1277,
    "مبارک آباددیز": 1278,
    "مبارک شهر": 1279,
    "مبارکه": 1280,
    "مجلسی": 1281,
    "مجن": 1282,
    "محلات": 1283,
    "محمدآباد": 1286,
    "محمدان": 1287,
    "محمدشهر": 1289,
    "محمدی": 1290,
    "محمدیار": 1291,
    "محمدیه": 1292,
    "محمله": 1293,
    "محمودآباد": 1295,
    "محمودآبادنمونه": 1296,
    "محی آباد": 1297,
    "مرادلو": 1298,
    "مراغه": 1299,
    "مراوه": 1302,
    "مرجقل": 1303,
    "مردهک": 1304,
    "مرزن آباد": 1305,
    "مرزیکلا": 1306,
    "مرگنلر": 1307,
    "مرند": 1308,
    "مرودشت": 1309,
    "مروست": 1310,
    "مریانج": 1311,
    "مریوان": 1312,
    "مزایجان": 1313,
    "مزدآوند": 1314,
    "مزرعه": 1315,
    "مس سرچشمه": 1316,
    "مسجدسلیمان": 1317,
    "مشراگه": 1320,
    "مشکات": 1321,
    "مشکان": 1323,
    "مشکین دشت": 1324,
    "مشگین شهر": 1325,
    "مشهد": 1326,
    "مشهد ثامن": 1328,
    "مشهدریزه": 1340,
    "مصیری": 1341,
    "معلم کلایه": 1342,
    "معمولان": 1343,
    "مغان سر": 1344,
    "مقاومت": 1345,
    "ملاثانی": 1346,
    "ملارد": 1347,
    "ملایر": 1348,
    "ملک آباد": 1349,
    "ملکان": 1350,
    "ممقان": 1351,
    "منج": 1352,
    "منجیل": 1353,
    "منصوریه": 1354,
    "منظریه": 1355,
    "منوجان": 1356,
    "موچش": 1357,
    "مود": 1358,
    "مورموری": 1359,
    "موسیان": 1360,
    "مومن آباد": 1361,
    "مهاباد": 1363,
    "مهاجران": 1365,
    "مهدی شهر": 1366,
    "مهر": 1368,
    "مهران": 1369,
    "مهربان": 1370,
    "مهردشت": 1371,
    "مهرستان": 1372,
    "مهریز": 1373,
    "میامی": 1374,
    "میان راهان": 1375,
    "میاندوآب": 1376,
    "میانرود": 1377,
    "میانشهر": 1378,
    "میانه": 1379,
    "میبد": 1380,
    "میداود": 1381,
    "میرآباد": 1382,
    "میرجاوه": 1383,
    "میلاجرد": 1384,
    "میمند": 1385,
    "میمه": 1387,
    "میناب": 1388,
    "مینودشت": 1389,
    "مینوشهر": 1390,
    "نازک علیا": 1391,
    "ناغان": 1392,
    "نافچ": 1393,
    "نالوس": 1394,
    "نایین": 1395,
    "نجف آباد": 1396,
    "نجف شهر": 1397,
    "نخل تقی": 1398,
    "ندوشن": 1399,
    "نراق": 1400,
    "نرجه": 1401,
    "نرماشیر": 1402,
    "نسیم شهر": 1403,
    "نشتارود": 1404,
    "نشتیفان": 1405,
    "نصرآباد": 1407,
    "نصرت آباد": 1408,
    "نصیرشهر": 1409,
    "نطنز": 1410,
    "نظام شهر": 1411,
    "نظرآباد": 1412,
    "نظرکهریزی": 1413,
    "نقاب": 1414,
    "نقده": 1415,
    "نقنه": 1416,
    "نکا": 1417,
    "نگار": 1418,
    "نگور": 1419,
    "نگین شهر": 1420,
    "نلاس": 1421,
    "نمین": 1422,
    "نوبران": 1423,
    "نوبندگان": 1424,
    "نوجین": 1425,
    "نوخندان": 1426,
    "نودان": 1427,
    "نودژ": 1428,
    "نودشه": 1429,
    "نوده خاندوز": 1430,
    "نور": 1431,
    "نورآباد": 1433,
    "نوربهار": 1434,
    "نوسود": 1435,
    "نوش آباد": 1436,
    "نوشهر": 1437,
    "نوشین": 1438,
    "نوک آباد": 1439,
    "نوکنده": 1440,
    "نهاوند": 1441,
    "نهبندان": 1442,
    "نی ریز": 1443,
    "نیاسر": 1444,
    "نیر": 1446,
    "نیشابور": 1447,
    "نیک آباد": 1450,
    "نیک پی": 1451,
    "نیک شهر": 1452,
    "نیل شهر": 1453,
    "نیمبلوک": 1454,
    "نیمور": 1455,
    "واجارگاه": 1456,
    "وایقان": 1457,
    "وحدتیه": 1458,
    "وحیدیه": 1459,
    "ورامین": 1460,
    "وراوی": 1461,
    "وردنجان": 1462,
    "ورزقان": 1463,
    "ورزنه": 1464,
    "ورنامخواست": 1465,
    "وزوان": 1466,
    "ونک": 1467,
    "ویس": 1468,
    "ویسیان": 1469,
    "هادی شهر": 1470,
    "هادیشهر": 1471,
    "هارونی": 1472,
    "هجدک": 1473,
    "هچیرود": 1474,
    "هرات": 1475,
    "هرسین": 1476,
    "هرمز": 1477,
    "هرند": 1478,
    "هریس": 1479,
    "هزارکانیان": 1480,
    "هشتبندی": 1481,
    "هشتپر (تالش)": 1482,
    "هشتجین": 1483,
    "هشترود": 1484,
    "هشتگرد": 1485,
    "هفت چشمه": 1486,
    "هفتگل": 1487,
    "هفشجان": 1488,
    "هلشی": 1489,
    "هماشهر": 1491,
    "همت آباد": 1492,
    "همدان": 1493,
    "هندودر": 1498,
    "هندیجان": 1499,
    "هنزا": 1500,
    "هوراند": 1501,
    "هوره": 1502,
    "هویزه": 1503,
    "هیدج": 1504,
    "هیدوچ": 1505,
    "هیر": 1506,
    "یاسوج": 1507,
    "یاسوکند": 1508,
    "یامچی": 1509,
    "یان چشمه": 1510,
    "یزد": 1511,
    "یزدان شهر": 1515,
    "یکه سعود": 1516,
    "یولاگلدی": 1517,
    "یونسی": 1518
  };
}
